      
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.vercel_project_directory.directory: Reading...[0m[0m
[0m[1mdata.vercel_project_directory.directory: Read complete after 0s [id=../../../doppelgengar.dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # vercel_deployment.deployment[0m will be created
[0m  [32m+[0m[0m resource "vercel_deployment" "deployment" {
      [32m+[0m[0m domains     = (known after apply)
      [32m+[0m[0m files       = {
          [32m+[0m[0m "../../../doppelgengar.dev/.eslintrc.json"              = "40~75e677e7192205173354ae9375c1d25ef78b0cec"
          [32m+[0m[0m "../../../doppelgengar.dev/README.md"                   = "1383~7186f4406725e6e20e302dd4d649698b641e8e3b"
          [32m+[0m[0m "../../../doppelgengar.dev/next.config.mjs"             = "92~d242b535f61738790c7f8ca71ab7e6f31f8e66ca"
          [32m+[0m[0m "../../../doppelgengar.dev/package-lock.json"           = "174098~26944610ab201d439e8fa3942c8e4d5bebd8a88b"
          [32m+[0m[0m "../../../doppelgengar.dev/package.json"                = "579~3bfd6db639df34e1ed396735adad4cbe76f5d944"
          [32m+[0m[0m "../../../doppelgengar.dev/postcss.config.js"           = "83~81781ed39dc8e6d6521ae1d63a67e46894acc2eb"
          [32m+[0m[0m "../../../doppelgengar.dev/public/logo.svg"             = "507~b5187b443b86e3852de433d8258ced9164d36079"
          [32m+[0m[0m "../../../doppelgengar.dev/src/app/components/page.tsx" = "408~c748cf9a1f6b4993b23f2c974911ba485836621e"
          [32m+[0m[0m "../../../doppelgengar.dev/src/app/layout.tsx"          = "517~2434e70976ad4dfa7cbc08d16c8cc5991c10effd"
          [32m+[0m[0m "../../../doppelgengar.dev/src/app/page.tsx"            = "3055~0f6ad0950d4911e6eb7a9305d484675905c1f677"
          [32m+[0m[0m "../../../doppelgengar.dev/src/styles/globals.css"      = "183~f86c21ff30b83e1971e07863089424299c9bc51f"
          [32m+[0m[0m "../../../doppelgengar.dev/src/ui/navHeader.module.css" = "263~06708eda3db8d798e4d3cc87e194580b8902f682"
          [32m+[0m[0m "../../../doppelgengar.dev/src/ui/navHeader.tsx"        = "445~3716e57bddba7303e3f0c010daf1b8e6933fea3d"
          [32m+[0m[0m "../../../doppelgengar.dev/tailwind.config.ts"          = "491~134637c2ce7fc2ce317edd688eea7a77c90eff95"
          [32m+[0m[0m "../../../doppelgengar.dev/tsconfig.json"               = "578~71beb4ab458ca43ab89af60332005d5eeb310700"
        }
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m path_prefix = "../../../doppelgengar.dev"
      [32m+[0m[0m production  = false
      [32m+[0m[0m project_id  = (known after apply)
      [32m+[0m[0m team_id     = (known after apply)
      [32m+[0m[0m url         = (known after apply)
    }

[1m  # vercel_project.portfolio[0m will be created
[0m  [32m+[0m[0m resource "vercel_project" "portfolio" {
      [32m+[0m[0m framework                               = "nextjs"
      [32m+[0m[0m id                                      = (known after apply)
      [32m+[0m[0m name                                    = "staging-doppelgengar-portfolio"
      [32m+[0m[0m protection_bypass_for_automation_secret = (known after apply)
      [32m+[0m[0m serverless_function_region              = (known after apply)
      [32m+[0m[0m team_id                                 = (known after apply)
      [32m+[0m[0m vercel_authentication                   = {
          [32m+[0m[0m protect_production = false
        }
    }

[1m  # vercel_project_domain.staging[0m will be created
[0m  [32m+[0m[0m resource "vercel_project_domain" "staging" {
      [32m+[0m[0m domain     = "staging.doppelgengar.dev"
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m project_id = (known after apply)
      [32m+[0m[0m team_id    = (known after apply)
    }

[1m  # vercel_project_domain.wwwstaging[0m will be created
[0m  [32m+[0m[0m resource "vercel_project_domain" "wwwstaging" {
      [32m+[0m[0m domain     = "www.staging.doppelgengar.dev"
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m project_id = (known after apply)
      [32m+[0m[0m team_id    = (known after apply)
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DoppelG3ngar, Action: `pull_request`, Working Directory: `./terraform/environments/staging`, Workflow: `Pull request from feature branch`*